import React from "react";
import ConfirmModal from "../../../../components/modal/ConfirmModal";

export default function ConfirmModalExample() {

    const title = "모달제목";
    const content = `
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
        모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용모달내용
    `;

    return (
        <div className="ConfirmModalExample-wrap">
            <ConfirmModal title={title} content={content}/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
            뒷배경내용<br/>
        </div>
    );
}
